Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཚེ་དང་ལྡན་པ་གང་པོ་ཟག་པ་དང་བཅས་པའི་གཟུགས་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །ཟག་པ་དང་བཅས་པའི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Venerable Pūrṇa, contaminated physical forms are neither fettered nor liberated, and contaminated feelings, perceptions, formative predispositions, and consciousness are neither fettered nor liberated.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་ཟག་པ་མེད་པའི་གཟུགས་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །ཟག་པ་མེད་པའི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: Venerable Pūrṇa, uncontaminated physical forms are neither fettered nor liberated, and uncontaminated feelings, perceptions, formative predispositions, and consciousness are neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། གཟུགས་མེད་པའི་ཕྱིར། གཟུགས་མ་བཅིངས་མ་གྲོལ་བའོ།
en: If you ask why, Venerable Pūrṇa, physical forms are neither fettered nor liberated because physical forms are nonexistent.

source: །གཟུགས་དབེན་པའི་ཕྱིར། གཟུགས་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Physical forms are neither fettered nor liberated because physical forms are void.

source: །གཟུགས་མ་སྐྱེས་པའི་ཕྱིར། གཟུགས་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Physical forms are neither fettered nor liberated because physical forms are nonarising.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་ཆོས་ཐམས་ཅད་ཀྱང་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: Venerable Pūrṇa, all phenomena are neither fettered nor liberated.

source: མེད་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: All phenomena are neither fettered nor liberated because they are nonexistent, they are neither fettered nor liberated because they are void, and they are neither fettered nor liberated because they are nonarising.

source: ཚེ་དང་ལྡན་པ་གང་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Venerable Pūrṇa, the perfection of generosity is neither fettered nor liberated.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་མེད་པའི་ཕྱིར། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མ་བཅིངས་མ་གྲོལ་བའོ། །དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Venerable Pūrṇa, the perfection of generosity is neither fettered nor liberated because it is nonexistent, it is neither fettered nor liberated because it is void, and it is neither fettered nor liberated because it is nonarising.

source: །མེད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are neither fettered nor liberated because they are nonexistent, they are neither fettered nor liberated because they are void, and they are neither fettered nor liberated because they are nonarising. “

source: དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །ཚེ་དང་ལྡན་པ་གང་པོ་ནང་སྟོང་པ་ཉིད་ཀྱང་མ་བཅིངས་མ་གྲོལ་བའོ། །ཕྱི་སྟོང་པ་ཉིད་ཀྱང་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Venerable Pūrṇa, the emptiness of internal phenomena is neither fettered nor liberated, the emptiness of external phenomena is neither fettered nor liberated, the emptiness of external and internal phenomena is neither fettered nor liberated, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are neither fettered nor liberated.

source: །ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱང་མ་བཅིངས་མ་གྲོལ་བའོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ཡང་མ་བཅིངས་མ་གྲོལ་བའོ། །ཚེ་དང་ལྡན་པ་གང་པོ་མེད་པའི་ཕྱིར་ནང་སྟོང་པ་ཉིད་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Venerable Pūrṇa, the emptiness of internal phenomena is neither fettered nor liberated because it is nonexistent, it is neither fettered nor liberated because it is void, and it is neither fettered nor liberated because it is nonarising.

source: །དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མེད་པའི་ཕྱིར་ཕྱི་སྟོང་པ་ཉིད་མ་བཅིངས་མ་གྲོལ་བའོ། །དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ།
en: The emptiness of external phenomena is neither fettered nor liberated because it is nonexistent, it is neither fettered nor liberated because it is void, and it is neither fettered nor liberated because it is nonarising.

source: །མེད་པའི་ཕྱིར་ཕྱི་ནང་སྟོང་པ་ཉིད་མ་བཅིངས་མ་གྲོལ་བའོ། །དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ།
en: The emptiness of external and internal phenomena is neither fettered nor liberated because it is nonexistent, it is neither fettered nor liberated because it is void, and it is neither fettered nor liberated because it is nonarising.

source: །མེད་པའི་ཕྱིར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མ་བཅིངས་མ་གྲོལ་བའོ། །དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ།
en: The [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are neither fettered nor liberated because they are nonexistent, they are neither fettered nor liberated because they are void, and they are neither fettered nor liberated because they are nonarising. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡང་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: Venerable Pūrṇa, the thirty-seven factors conducive to enlightenment are also neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་མེད་པའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་མ་བཅིངས་མ་གྲོལ་བའོ། །དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Venerable Pūrṇa, the thirty-seven factors conducive to enlightenment are neither fettered nor liberated because they are nonexistent, they are neither fettered nor liberated because they are void, and they are neither fettered nor liberated because they are nonarising.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའི་བར་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་མ་བཅིངས་མ་གྲོལ་བ་སྟེ། ཚེ་དང་ལྡན་པ་གང་པོ་མེད་པའི་ཕྱིར།
en: Venerable Pūrṇa, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are neither fettered nor liberated.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་མ་བཅིངས་མ་གྲོལ་བའོ། །དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Venerable Pūrṇa, the eighteen distinct qualities of the buddhas [and those other fruitional attributes] are neither fettered nor liberated because they are nonexistent, they are neither fettered nor liberated because they are void, and they are neither fettered nor liberated because they are nonarising. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: Venerable Pūrṇa, [the goals], up to and including all-aspect omniscience, are neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་མེད་པའི་ཕྱིར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་བཅིངས་མ་གྲོལ་བའོ། །དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Venerable Pūrṇa, all-aspect omniscience [and the other goals] are neither fettered nor liberated because they are nonexistent, they are neither fettered nor liberated because they are void, and they are neither fettered nor liberated because they are nonarising. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: Venerable Pūrṇa, bodhisattvas also are neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་མེད་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Venerable Pūrṇa, bodhisattvas are neither fettered nor liberated because they are nonexistent, they are neither fettered nor liberated because they are void, and they are neither fettered nor liberated because they are nonarising. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་ཉིད་ཀྱང་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་།
en: Venerable Pūrṇa, the real nature is also neither fettered nor liberated.

source: ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་ཡང་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: The unmistaken real nature, the one and only real nature, the reality, the realm of phenomena, the abiding nature of reality, the maturity with respect to all phenomena, and the very limit of reality are neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་མེད་པའི་ཕྱིར། དེ་བཞིན་ཉིད་མ་བཅིངས་མ་གྲོལ་བའོ། །དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Venerable Pūrṇa, the real nature is neither fettered nor liberated because it is nonexistent, it is neither fettered nor liberated because it is void, and it is neither fettered nor liberated because it is nonarising. [

source: །མེད་པའི་ཕྱིར་ཡང་དག་པའི་མཐའི་བར་དུ་མ་བཅིངས་མ་གྲོལ་བའོ། །དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Those other realities], up to and including the very limit of reality, are neither fettered nor liberated because they are nonexistent, they are neither fettered nor liberated because they are void, and they are neither fettered nor liberated because they are nonarising. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་འདུས་མ་བྱས་ཀྱང་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: Venerable Pūrṇa, unconditioned phenomena also are neither fettered nor liberated.

source: ཚེ་དང་ལྡན་པ་གང་པོ་མེད་པའི་ཕྱིར་འདུས་མ་བྱས་མ་བཅིངས་མ་གྲོལ་བའོ། །དབེན་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་སྐྱེས་པའི་ཕྱིར་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Venerable Pūrṇa, unconditioned phenomena are neither fettered nor liberated because they are nonexistent, they are neither fettered nor liberated because they are void, and they are neither fettered nor liberated because they are nonarising. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མ་བཅིངས་མ་གྲོལ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: Venerable Pūrṇa, this is the portal of the Dharma indicating that bodhisattva great beings are neither fettered nor liberated.

source: དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་བཅིངས་མ་གྲོལ་བའོ།
en: In this regard, the perfection of generosity is neither fettered nor liberated.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་བཅིངས་མ་གྲོལ་བའོ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are neither fettered nor liberated. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མ་བཅིངས་མ་གྲོལ་བའོ།
en: The attributes and goals], up to and including all-aspect omniscience, are neither fettered nor liberated.

source: །བྱང་ཆུབ་སེམས་དཔའ་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Bodhisattvas are neither fettered nor liberated.

source: །སངས་རྒྱས་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Buddhas are neither fettered nor liberated.

source: །དེ་བཞིན་ཉིད་མ་བཅིངས་མ་གྲོལ་བའོ། །མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་།
en: The real nature is neither fettered nor liberated.

source: ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་མ་བཅིངས་མ་གྲོལ་བའོ།
en: The unmistaken real nature, the one and only real nature, the reality, the realm of phenomena, the abiding nature of reality, the maturity with respect to all phenomena, and the very limit of reality are neither fettered nor liberated.

source: །འདུས་མ་བྱས་མ་བཅིངས་མ་གྲོལ་བའོ།
en: Unconditioned phenomena are neither fettered nor liberated. “[

source: །དེ་མ་བཅིངས་མ་གྲོལ་བའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས།
en: Bodhisattva great beings] dwell in the perfection of generosity that is neither fettered nor liberated.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ནས།
en: They dwell in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom [that are neither fettered nor liberated].

source: མ་བཅིངས་མ་གྲོལ་བའི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་གནས།
en: They dwell in [the attributes and goals], up to and including all-aspect omniscience, that are neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་དེ་བཞིན་ཉིད་ལ་གནས།
en: They dwell in the real nature that is neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། མ་བཅིངས་མ་གྲོལ་བའི་གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། མ་བཅིངས་མ་གྲོལ་བའི་ཆོས་ཉིད་དང་། མ་བཅིངས་མ་གྲོལ་བའི་ཆོས་ཀྱི་དབྱིངས་དང་། མ་བཅིངས་མ་གྲོལ་བའི་ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་།
en: They dwell in the unmistaken real nature that is neither fettered nor liberated, the one and only real nature that is neither fettered nor liberated, the reality that is neither fettered nor liberated, the realm of phenomena that is neither fettered nor liberated, the abiding nature of reality that is neither fettered nor liberated, the maturity with respect to all phenomena that is neither fettered nor liberated, and the very limit of reality that is neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་ཡང་དག་པའི་མཐའ་ལ་གནས།
en: They dwell in unconditioned phenomena that are neither fettered nor liberated. “

source: མ་བཅིངས་མ་གྲོལ་བའི་འདུས་མ་བྱས་པ་ལ་གནས་ཏེ་མ་བཅིངས་མ་གྲོལ་བ་དེ། མ་བཅིངས་མ་གྲོལ་བའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: Being neither fettered nor liberated, they bring to maturity beings who are neither fettered nor liberated.

source: །མ་བཅིངས་མ་གྲོལ་བ་དེ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དོ། །མ་བཅིངས་མ་གྲོལ་བ་དེ།
en: Being neither fettered nor liberated, they refine buddhafields that are neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བྱེད་དོ།
en: Being neither fettered nor liberated, they venerate the lord buddhas who are neither fettered nor liberated.

source: །མ་བཅིངས་མ་གྲོལ་བ་དེ། མ་བཅིངས་མ་གྲོལ་བའི་ཆོས་ཉན་ཏོ།
en: Being neither fettered nor liberated, they listen to the Dharma that is neither fettered nor liberated.

source: །མ་བཅིངས་མ་གྲོལ་བ་དེ་མ་བཅིངས་མ་གྲོལ་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་རོ། །མ་བཅིངས་མ་གྲོལ་བ་དེ།
en: Being neither fettered nor liberated, they will never be separated from the lord buddhas who are neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་མངོན་པར་ཤེས་པ་རྣམས་དང་ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་རོ།
en: Being neither fettered nor liberated, they will never be separated from the extrasensory powers that are neither fettered nor liberated.

source: །མ་བཅིངས་མ་གྲོལ་བ་དེ། མ་བཅིངས་མ་གྲོལ་བའི་མིག་ལྔ་དང་ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་རོ། །མ་བཅིངས་མ་གྲོལ་བ་དེ།
en: Being neither fettered nor liberated, they will never be separated from the five eyes that are neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་གཟུངས་རྣམས་དང་ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་རོ།
en: Being neither fettered nor liberated, they will never be separated from the dhāraṇīs that are neither fettered nor liberated.

source: །མ་བཅིངས་མ་གྲོལ་བ་དེ། མ་བཅིངས་མ་གྲོལ་བའི་ཏིང་ངེ་འཛིན་རྣམས་དང་ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་རོ། །མ་བཅིངས་མ་གྲོལ་བ་དེ།
en: Being neither fettered nor liberated, they will never be separated from the meditative stabilities that are neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་གྲོལ་བར་མི་འགྱུར་རོ།
en: Being neither fettered nor liberated, they will develop knowledge of the path that is neither fettered nor liberated.

source: །མ་བཅིངས་མ་གྲོལ་བ་དེ། མ་བཅིངས་མ་གྲོལ་བའི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Being neither fettered nor liberated, they will attain consummate buddhahood in all-aspect omniscience that is neither fettered nor liberated.

source: །མ་བཅིངས་མ་གྲོལ་བ་དེ། མ་བཅིངས་མ་གྲོལ་བའི་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་འགྱུར་རོ། །མ་བཅིངས་མ་གྲོལ་བ་དེ།
en: Being neither fettered nor liberated, they will turn the wheel of the Dharma that is neither fettered nor liberated.

source: མ་བཅིངས་མ་གྲོལ་བའི་སེམས་ཅན་རྣམས་ཐེག་པ་གསུམ་ལ་རབ་ཏུ་འགོད་པར་འགྱུར་ཏེ།
en: Being neither fettered nor liberated, they will consolidate in the three vehicles those beings who are neither fettered nor liberated. “

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མ་བཅིངས་མ་གྲོལ་བ་དེ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་མ་བཅིངས་མ་གྲོལ་བས།
en: Venerable Pūrṇa, so it is that bodhisattva great beings who are unfettered and unliberated will comprehend all phenomena by means of the six perfections that are neither fettered nor liberated.

source: མེད་པ་དང་། དབེན་པ་དང་། སྐྱེ་བ་མེད་པ་ཉེ་བར་བཟུང་ཞིང་། ཆོས་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: This is because all phenomena are nonexistent, void, and nonarising. {

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མ་བཅིངས་མ་གྲོལ་བ་ཐེག་པ་ཆེན་པོའི་གོ་ཆ་ཆེན་པོ་བགོས་པར་རིག་པར་བྱའོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: Dt.194} Venerable Pūrṇa, one should know that it is in this way that bodhisattva great beings don the great armor of the Great Vehicle that is neither fettered nor liberated.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་གང་ལགས།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, what is the Great Vehicle of bodhisattva great beings?

source: བཅོམ་ལྡན་འདས་ཇི་ཙམ་གྱིས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པར་རིག་པར་བགྱི་བ་ལགས།
en: Blessed Lord, how should bodhisattva great beings be known as entering the Great Vehicle?

source: ཐེག་པ་ཆེན་པོ་དེ་ནི་གང་ནས་བྱུང་བ་ལགས།
en: From where does this Great Vehicle depart?

source: ཐེག་པ་དེ་ནི་གང་དུ་གནས་པར་འགྱུར་བ་ལགས།
en: Where does this vehicle bring one to rest?

source: ཐེག་པ་དེས་ནི་སུ་ཞིག་འབྱུང་བར་འགྱུར།
en: Who will depart using this vehicle?”

source: དེ་སྐད་ཅེས་གསོལ་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་གང་ཁྱོད་དེ་སྐད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་གང་ཞེས་ཟེར་བ་ནི།
en: The Blessed One replied to the venerable Subhūti, “Subhūti, you have asked what is the Great Vehicle of bodhisattva great beings.

source: རབ་འབྱོར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་སྟེ།
en: Subhūti, the six perfections constitute the Great Vehicle of bodhisattva great beings.

source: དྲུག་གང་ཞེ་ན། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: If you ask what these six are, they comprise the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what is the perfection of generosity?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་དོན་དུ་གཉེར་བ་རྣམས་ལ། ཕྱི་ནང་གི་དངོས་པོའི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་སྟེ། སྦྱིན་པ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཡོངས་སུ་བསྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Subhūti,” replied the Blessed One, “when bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind, give inner or outer objects to those who strive for them and then dedicate [the merit of] these gifts, without apprehending anything, for the sake of unsurpassed, complete enlightenment, making common cause with all beings, that is the perfection of generosity possessed by bodhisattva great beings.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what is the perfection of ethical discipline?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། བདག་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ཤིང་གནས་ལ། སེམས་ཅན་ཕ་རོལ་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཡང་དག་པར་སྐུལ་བ་དང་། གཞོག་པ་དང་། རབ་ཏུ་འགོད་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་མ་ཉམས་པའོ།
en: Subhūti,” replied the Blessed One, “when bodhisattva great beings who have cultivated the mind set on all-aspect omniscience, themselves adopt and maintain correctly the paths of the ten virtuous actions, and also correctly induce, secure, and establish others on the path of virtuous actions, and they do so without apprehending anything, this is the unblemished perfection of ethical discipline possessed by bodhisattva great beings.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what is the perfection of tolerance?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། བདག་ཀྱང་བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ལ། གཞན་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བཟོད་པ་ལ་ཡང་དག་པར་སྐུལ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Subhūti,” replied the Blessed One, “when bodhisattva great beings who have cultivated the mind set on all-aspect omniscience themselves possess the excellent endowments of tolerance, and also correctly induce others toward tolerance, and they do so without apprehending anything, this is the perfection of tolerance possessed by bodhisattva great beings.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what is the perfection of perseverance?” {

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། བདག་ཀྱང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་བརྩོན་པ་མི་འདོར་ཞིང་། གཞན་ཡང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་སྦྱོར་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །གསོལ་པ།
en: Dt.195} “Subhūti,” replied the Blessed One, “when bodhisattva great beings who have cultivated the mind set on all-aspect omniscience are themselves indefatigable with respect to the six perfections, and also engage others in the six perfections, and they do so without apprehending anything, this is the perfection of perseverance possessed by bodhisattva great beings.” “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what is the perfection of meditative concentration?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདག་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། བསམ་གཏན་རྣམས་ལ་ཐབས་མཁས་པར་མཉམ་པར་གཞོག་ཀྱང་། དེ་དག་གི་དབང་གིས་མི་སྐྱེ་ཞིང་། གཞན་ཡང་བསམ་གཏན་རྣམས་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཡང་དག་པར་སྐུལ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Subhūti,” replied the Blessed One, “when bodhisattva great beings who have themselves cultivated the mind set on all-aspect omniscience are skillfully absorbed in the meditative concentrations, but on that account are no longer subject to rebirth, while they also correctly induce others toward these meditative concentrations, and they do so without apprehending anything, this is the perfection of meditative concentration possessed by bodhisattva great beings.” “
